// docs/.vitepress/plugins/glossary-data.mts
// 全局术语词典数据（随便加，不用管顺序！插件引擎会自动按长度排序）

export const glossary: Record<string, string> = {
  '单例模式': '/01-计算机与IT技术/02-设计模式/01-单例模式',
  '工厂模式': '/01-计算机与IT技术/02-设计模式/02-工厂模式',
  '代理模式': '/01-计算机与IT技术/02-设计模式/03-代理模式',

  'RAG': '/01-计算机与IT技术/01-比特就业课/03-LangChain&LangGraph-AI应用开发框架精品课/01-LangChain-AI应用开发框架精品课/02-嵌入式模型#应用场景',

  "直接插入排序": '/01-计算机与IT技术/01-比特就业课/01-Java研发系统课118期/02-Java数据结构/01-数据结构初阶/2025-07-31-排序#直接插入排序',
  "希尔排序": '/01-计算机与IT技术/01-比特就业课/01-Java研发系统课118期/02-Java数据结构/01-数据结构初阶/2025-07-31-排序#希尔排序',
  "选择排序": '/01-计算机与IT技术/01-比特就业课/01-Java研发系统课118期/02-Java数据结构/01-数据结构初阶/2025-07-31-排序#选择排序',
  "堆排序": '/01-计算机与IT技术/01-比特就业课/01-Java研发系统课118期/02-Java数据结构/01-数据结构初阶/2025-07-31-排序#堆排序',
  "冒泡排序": '/01-计算机与IT技术/01-比特就业课/01-Java研发系统课118期/02-Java数据结构/01-数据结构初阶/2025-07-31-排序#冒泡排序',
  "快速排序": '/01-计算机与IT技术/01-比特就业课/01-Java研发系统课118期/02-Java数据结构/01-数据结构初阶/2025-07-31-排序#快速排序',
  "归并排序": '/01-计算机与IT技术/01-比特就业课/01-Java研发系统课118期/02-Java数据结构/01-数据结构初阶/2025-07-31-排序#归并排序',
  "计数排序": '/01-计算机与IT技术/01-比特就业课/01-Java研发系统课118期/02-Java数据结构/01-数据结构初阶/2025-07-31-排序#计数排序',
  "基数排序": '/01-计算机与IT技术/01-比特就业课/01-Java研发系统课118期/02-Java数据结构/01-数据结构初阶/2025-07-31-排序#基数排序',
  "桶排序": '/01-计算机与IT技术/01-比特就业课/01-Java研发系统课118期/02-Java数据结构/01-数据结构初阶/2025-07-31-排序#桶排序',



  '不背单词': '/00-学习技巧/02-英语/00-单词背诵软件推荐#不背单词',
  'Anki': '/00-学习技巧/02-英语/00-单词背诵软件推荐#anki',
  // '科目一': '/驾考交规/01-科目一/index',
};
